    /// Булгаков А.С.; Игра "Пьяница"
    /// Основная процедура
MAIN
    n name,cwidth,cheight,key,crd,rul,game
    s name = "КАРТОЧНАЯ ИГРА ПЬЯНИЦА"
    s cwidth=80 ; ширина
    s cheight=25 ; высота
    ; карты
    s crd(1)="2Ч;2",crd(2)="2Б;2",crd(3)="2П;2",crd(4)="2K;2"
    s crd(5)="3Ч;3",crd(6)="3Б;3",crd(7)="3П;3",crd(8)="3K;3"
    s crd(9)="4Ч;4",crd(10)="4Б;4",crd(11)="4П;4",crd(12)="4K;4"
    s crd(13)="5Ч;5",crd(14)="5Б;5",crd(15)="5П;5",crd(16)="5K;5"
    s crd(17)="6Ч;6",crd(18)="6Б;6",crd(19)="6П;6",crd(20)="6K;6"
    s crd(21)="7Ч;7",crd(22)="7Б;7",crd(23)="7П;7",crd(24)="7K;7"
    s crd(25)="8Ч;8",crd(26)="8Б;8",crd(27)="8П;8",crd(28)="8K;8"
    s crd(29)="9Ч;9",crd(30)="9Б;9",crd(31)="9П;9",crd(32)="9K;9"
    s crd(33)="10Ч;10",crd(34)="10Б;10",crd(35)="10П;10",crd(36)="10K;10"
    s crd(37)="ВЧ;11",crd(38)="ВБ;11",crd(39)="ВП;11",crd(40)="ВK;11"
    s crd(41)="ДЧ;12",crd(42)="ДБ;12",crd(43)="ДП;12",crd(44)="ДK;12"
    s crd(45)="КЧ;13",crd(46)="КБ;13",crd(47)="КП;13",crd(48)="КK;13"
    s crd(49)="ТЧ;14",crd(50)="ТБ;14",crd(51)="ТП;14",crd(52)="ТK;14"
    ; правила
    s rul(1)="Количество карт в колоде: 52"
    s rul(2)="Старшинство карт: 2,3,4,5,6,7,8,9,10,В,Д,К,Т"
    s rul(3)="Цель игры: собрать все карты у себя"
    s rul(4)="Правила игры:"
    s rul(5)="Сдатчик карт определяется жребием"
    s rul(6)="Карты в колоде тщательно тасуются колода раздается"
    s rul(7)="поровну между игроками. Игроки не смотрят своих карт,"
    s rul(8)="а кладут их стопкой в закрытом виде возле себя."
    s rul(9)="Первый ход принадлежит сдатчику карт, он снимает"
    s rul(10)="свою верхнюю карту, открывает и кладет на центр стола"
    s rul(11)="в открытом виде. Другие игроки по кругу по часовой"
    s rul(12)="стрелке делают то же самое. Затем смотрят чья карта"
    s rul(13)="старше, тот игрок у которого карта старше, забирает карты"
    s rul(14)="и кладет их в том же порядке под низ своей колоды."
    s rul(15)="Если у игроков окажутся равные старшие карты,"
    s rul(16)="то забирает тот игрок, который первый положит эту карту,"
    s rul(17)="а первый кладет тот, кто по часовой стрелке находится"
    s rul(18)="левее другого игрока. Далее ход переходит к следующему"
    s rul(19)="игроку по часовой стрелке. Если у игрока заканчиваются "
    s rul(20)="карты, то он выбывает из игры. Выигрывает игрок, который"
    s rul(21)="соберет все карты у себя."
    d ECHOOFF
    d CLRSCR
    d TOP ; вывод щапки
    d FOOT ; вывод подвала
    d MENU ; запуск меню
    d CLRSCR
    d ECHOON
    q
CRS ; курсор в угол
    w /CUP(cheight,cwidth)
    q
SGR0 ; оформление 0
    w /SGR(0,47,30) ; off,f:black,b:white
    q
SGR1 ; оформление 1
    w /SGR(0,37,44) ; off,f:white,b:black
    q
SGR2 ; оформление 2
    w /SGR(0,30,43) ; off,f:black,b:yellow
    q
SGR3 ; оформление 3
    w /SGR(0,37,42) ; off,f:white,b:green
    q
    /// Заполнение блока
    /// [Параметры]
    /// t - по вертикали
    /// l - по горизонтали
    /// w - шиина блока
    /// h - высота блока
    /// c - код символа
    /// [Описание]
    /// Заполнение блока строк переданным 
    /// символом по его коду и
    /// по указанным параметрам блока
BG(t,l,w,h,c)
    s:$d(w)=0 w = cwidth
    s:$d(h)=0 h = cheight
    s:$d(c)=0 c = 183
    f i=1:1:h  d
    . w /CUP(t-1+i,l) ; на строку
    . f j=1:1:w w $c(c) ; заполнение
    d CRS
    q   
    /// Текст в подвале
    /// [Параметры]
    /// t - текст
    /// dt - смещение
    /// [Описание]
    /// Устанавливаем курсор в подвал окна
    /// удаляем все символы строки и выводим текст
tf(t,dt)
    s dt = $g(dt,0)
    w /CUP(cheight-dt,1),/ECH(cwidth),$g(t)
    d CRS
    q
    /// Подсказка
    /// [Параметры]
    /// t - текст
    /// [Описание]
    /// Вывод подсказки в подвал окна
hint(t)
    d tf(t,3)
    q
key() ; код кнопки
    n k,c,b
    s b(3)="CTRL+C"
    s b(8)="BS"
    s b(9)="TAB"
    s b(13)="ENT"
    s b(21)="CAN"
    s b(27)="ESC"
    s b(32)="SPACE"
    s b(127)="DEL"
    s b(27_91_49_126)="HOME"
    s b(27_91_51_126)="INS"
    s b(27_91_51_126)="DEL"
    s b(27_91_52_126)="END"
    s b(27_91_53_126)="PAGE-UP"
    s b(27_91_54_126)="PAGE-DOWN"
    s b(27_91_65)="UP"
    s b(27_91_66)="DOWN"
    s b(27_91_67)="RIGHT"
    s b(27_91_68)="LEFT"
    s b(27_79_80)="F1"
    s b(27_79_81)="F2"
    s b(27_79_82)="F3"
    s b(27_79_83)="F4"
    s b(27_79_84)="F5"
    s b(27_91_49_55_126)="F6"
    s b(27_91_49_56_126)="F7"
    s b(27_91_49_57_126)="F8"
    s b(27_91_50_48_126)="F9"
    s b(27_91_50_49_126)="F10"
    s b(27_91_50_51_126)="F11"
    s b(27_91_50_52_126)="F12"
    r *k
    f  s c=$$byte() s:c k=k_c q:'c ; escape
    s k = $g(b(k),k)
    d tf(k)
    q k
byte() ; escape
    n i,c
    f i=1:1:10 r *c:0 q:c'<0
    q:c'<0 c
    q 0
CLRSCR ; очистка экрана
    w #
    q
ECHOON ; включить ECHO
    u 0:(0:"")
    q
ECHOOFF ; выключить ECHO
    u 0:(0:"SI")
    q
TOP ; шапка
    n t,l,w,h
    s t=1,l=1,w=cwidth,h=3
    d SGR1
    d BG(t,l,w,h,32)
    w /CUP(t+1,l+1),/SGR(4), name
    d SGR0
    d CRS
    q
FOOT ; подвал
    n t,l,w,h
    s t=(cheight-2),l=1,w=cwidth,h=2
    d BG(t,l,w,h,32)
    w /CUP(t,l)  f i=1:1:w w "-" ; верх
    w $g(key) ; код кнопки
    d CRS
    q
CLEAR ; очиска центра
    d BG(4,1,cwidth,cheight-7,32)
    q
MENU ; главное меню
    n t,l,w,h,hd,p,q
    s w=30,h=7,t=7,l=cwidth-w/2,p=1
    s hd = "Главное меню"
    s it(1) = "Играть"
    s it(2) = "Правила игры"
    s it(3) = "Выход"
    d CLEAR
    d SGR1
    d BG(t,l,w,1,32) ; чистка
    w /CUP(t,l+5), hd ; заголовок
    ; обработка, q выход
    f  q:$d(q)  d
    . s:p>3 p = 3
    . s:p<1 p = 1
    . d SGR2
    . d BG(t+1,l,w,h-1,32) ; чистка
    . f i=1:1:3  d ; пункты
    . . w /CUP(t+1+i,l+5)
    . . w:i=p /CUB(2),"->"
    . . w $g(it(i)),!
    . d SGR0 
    . d CRS
    . s key = $$key()
    . i key ="UP" s p = p - 1
    . i key ="DOWN" s p = p + 1
    . i key ="ENT" d
    . . i p=1 s q=1 d GAME
    . . i p=2 s q=1 d RULES
    . . i p=3 s q=1
    q
RULES ; правила игры
    n t,l,w,h,hd,p,pgs,q,ls,lm
    s w=cwidth,h=cheight-7,t=4,l=1,p=0
    s hd = "Правила игры"
    d hint("F1-меню;LEFT-назад;RIGHT-вперед;")
    d CLEAR
    d SGR3
    d BG(t,l,w,1,32) ; чистка
    w /CUP(t,l+1), hd ; заголовок
    d SGR0
    s lm = h-2 ; ограничение вывода строк
    s ls = $o(rul(""),-1) ; последний = кол-во строк
    s pgs = ls\lm + 1 ; всего страниц
    ; обработка, q выход
    f  q:$d(q)  d
    . s:p>pgs p = pgs
    . s:p<1 p = 1
    . d BG(t+1,l,w,lm,32)
    . f i=1:1:lm  d
    . . w /CUP(t+i,l+2)
    . . w $g(rul(p-1*lm+i))
    . d CRS
    . s key = $$key()
    . i key="F1" s q=1 d MENU
    . i key="LEFT" s p = p - 1
    . i key="RIGHT" s p = p + 1
    q
GAME ; игра
    n t,w,h,hd,q,cr,ch,wi
    s w=cwidth,h=cheight-7,t=4
    i '$d(game) n qs,un,uc
    i '$d(game) d MIX
    d hint("F1-меню;F2-новая;F3-ход")
    d CLEAR
    d SGR3
    d BG(t,1,w,1,32)
    w /CUP(t,2),"ИГРА"
    d SGR0
    d GSET ; старт
    d CNT ; подсчет карт
    d BG(t+1,1,w,h-1,32)
    w /CUP(5), " Игроки: "_qs
    w /CUP(6)
    ; игроки с картами
    s cu=0
    f i=1:1:qs d 
    . i uc(i)>0 s cu=cu+1
    ; ход
    s vl=0
    f i=1:1:qs  d
    . i cu<2 q
    . i uc(i)=0 q
    . s j=$o(uc(i,""))
    . s v=$g(uc(i,j)) ; карта
    . s m=$p(v,";",1) ; масть
    . s w=$p(v,";",2) ; вес
    . i w>vl s cr=m,vl=w,wi=i
    . s ch(i)=j
    . k uc(i,j)
    . w !," Игрок:"_un(i)_";"
    . w " Карты:"_uc(i),!
    . w " Ход: "_m,!
    //. w " " s j=$o(uc(i,""))
    //. f  s j=$o(uc(i,j)) q:j=""  d
    //. . s v=$g(uc(i,j))
    //. . w $p(v,";",1)_";" 
    w !," Побеждает карта: "_cr,!
    ; добавление карт
    f i=1:1:qs  d
    . i uc(i)=0 q
    . s v=ch(i)
    . s uc(wi,v)=crd(v)
    k ch
    ; победа игрока
    i cu=1 d  s i=$o(cu(""))
    . w " Побеждает игрок "_cu(i),! 
    d CRS
    ; обработка, q выход
    f  q:$d(q)  d
    . s key = $$key()
    . i key="F1" s q=1 d MENU
    . i key="F2" k game s q=1 d GAME
    . i key="F3" s q=1 d GAME
    q
MIX ; тасовка карт
    n i,j,t
    f i=52:-1:1  d
    . s j=$r(52)+1
    . s t=crd(j)
    . s crd(j)=crd(i)
    . s crd(i)=t
    q
GSET
    i '$d(game) d
    . s qs=$$qw(t+2,2,"Игроков(2-6):","1N")
    . s:qs<2 qs=2
    . s:qs>6 qs=6
    . f i=1:1:qs  d ; имена
    . . s m="Игрок("_i_"):"
    . . s un(i)=$$qw(t+3+i,2,m,"1.25E")
    . f i=1:1:52  d ; раздача
    . . s j=i#qs+1
    . . s uc(j,i)=crd(i)
    s game=1
    q
    /// Вопросы / Ответы
    /// [Параметры]
    /// t - по вертикали
    /// l - по горизонтали
    /// qw - вопрос
    /// exp - шаблон
    /// [Описание]
    /// Обработка вопросов и ответов
    /// с проверкой ответа по шаблону
qw(t,l,qw,exp)
    d ECHOON
    w /CUP(t,l),/EL(2),qw
    r str
    d ECHOOFF
    if str ? @exp q str
    q $$qw(t,l,qw,exp)
CNT ; кол-во карт
    f i=1:1:qs d
    . s uc(i)=0
    . s n=$o(uc(i,""))
    . f  q:n=""  d
    . . s n=$o(uc(i,n))
    . . s uc(i)=$i(uc(i))
    q